app/Controllers/UserController.php

    public function edit($id)
    {
        $modelModel = new UserModel();
        $user = $modelModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'